{
  "Speakers": [
    {
      "Id": "amy-van-bijsterveldt",
      "FullName": "Amy van Bijsterveldt",
      "Bio": "Amy is a data engineer with a passion for building modern data platforms and delivering data-driven solutions. She holds a degree in Cognitive Science \u0026 Artificial Intelligence and has been working in the tech industry for several years. Amy is also an enthusiastic trainer and enjoys sharing her knowledge with others. She regularly conducts workshops on Managed Cloud Platforms and Infrastructure as Code (IaC). Outside of work, Amy enjoys playing the piano and video games, as well as hosting a radio show at a local radio station.",
      "TagLine": "IT Consultant @ Info Support",
      "IsTopSpeaker": false,
      "ProfilePictureUrl": "img/winter-2024/speakers/amy-van-bijsterveldt.jpg",
      "sessions": [
        "tales-from-the-trenches-a-new-data-engineers-story-of-success-and-struggle"
      ]
    },
    {
      "Id": "anu-singh",
      "FullName": "Anu Singh",
      "Bio": "Interested in speaking about data",
      "TagLine": "Microsoft - FTA Engineer",
      "IsTopSpeaker": false,
      "ProfilePictureUrl": "img/winter-2024/speakers/anu-singh.jpg",
      "sessions": [
        "supercharge-your-data-analysis-with-azure-databricks-and-microsoft-fabric-integration"
      ]
    },
    {
      "Id": "barbara-forbes",
      "FullName": "Barbara Forbes",
      "Bio": "Barbara works as the Azure technical lead for OGD in the Netherlands. She is a Microsoft MVP Azure, MCT and GitHub Star. Her focus is on Azure and automation. Think Serverless, Azure DevOps, PowerShell, GitHub and Infrastructure as Code. She loves teaching in an approachable way. She regularly writes posts for her blog https://4bes.nl and speaks at conferences and user groups. She helps grow the community as co-owner of the Dutch DevOps \u0026 GitHub community (DDOG), as well as co-hosting the Dutch PowerShell User Group (DUPSUG). ",
      "TagLine": "Azure technical lead @ OGD | Azure MVP | GitHub Star",
      "IsTopSpeaker": false,
      "ProfilePictureUrl": "img/winter-2024/speakers/barbara-forbes.jpg",
      "sessions": [
        "github-codespaces-for-everyone-everywhere"
      ]
    },
    {
      "Id": "daniel-mertens",
      "FullName": "Daniël Mertens",
      "Bio": "Daniël is a software consultant at Info Support with a passion for problem solving. He loves solving coding puzzle and participating in Hackathons and coding challenges.",
      "TagLine": "Info Support - Software Engineer",
      "IsTopSpeaker": false,
      "ProfilePictureUrl": "img/winter-2024/speakers/daniel-mertens.jpg",
      "sessions": [
        "accelerate-your-frontend-development-with-micro-apps"
      ]
    },
    {
      "Id": "dennis-doomen",
      "FullName": "Dennis Doomen",
      "Bio": "Dennis is a Microsoft MVP and a veteran hands-on architect in the .NET space with a special interest in writing clean code, Domain Driven Design, Event Sourcing and everything agile. He specializes in designing enterprise solutions based on the .NET technologies as well as providing coaching on all aspects of designing, building and maintaining enterprise systems. He is the author of www.fluentassertions.com, a very popular .NET assertion framework, www.liquidprojections.net, a set of libraries for building Event Sourcing architectures and he has been maintaining coding guidelines for C# on www.csharpcodingguidelines.com since 2001. He also keeps a blog on his everlasting quest for better solutions at www.continuousimprover.com. You can reach him on Twitter through @ddoomen and on Mastodon through @ddoomen@mastodon.social.",
      "TagLine": "Hands-on architect in the .NET space with 26 years of experience on an everlasting quest for knowledge to build the right software the right way at the right time",
      "IsTopSpeaker": false,
      "ProfilePictureUrl": "img/winter-2024/speakers/dennis-doomen.jpg",
      "sessions": [
        "getting-a-grip-on-your-code-dependencies"
      ]
    },
    {
      "Id": "glenn-versweyveld",
      "FullName": "Glenn Versweyveld",
      "Bio": "Glenn Versweyveld is a developer with interest in everything surrounding Microsoft and .NET in particular, currently working as a System Expert at Baliose Insurances.\r\nStill loves Windows Phone, but don\u0027t judge him for it :)\r\n\r\nCurrently Microsoft MVP in Developer Technologies",
      "TagLine": "\u0027SH10151\u0027 this is the serial number of our orbital gun",
      "IsTopSpeaker": false,
      "ProfilePictureUrl": "img/winter-2024/speakers/glenn-versweyveld.jpeg",
      "sessions": [
        "add-observability-to-any-microservices-environment-part-1",
        "add-observability-to-any-microservices-environment-part-2"
      ]
    },
    {
      "Id": "ivo-geurtsen",
      "FullName": "Ivo Geurtsen",
      "Bio": "IT Consultant @ Info Support",
      "TagLine": "IT Consultant @ Info Support",
      "IsTopSpeaker": false,
      "ProfilePictureUrl": "img/winter-2024/speakers/ivo-geurtsen.jpg",
      "sessions": [
        "microsoft-fabric-onelake-to-rule-them-all"
      ]
    },
    {
      "Id": "jarne-van-aerde",
      "FullName": "Jarne Van Aerde",
      "Bio": "Everyone wants to make the world a better place, we each do this by different actions. I do this by sharing knowledge to the best of my ability. I get great joy from explaining something that is not easy to understand, but in such a way that it becomes trivial and fun to listen to.\r\n\r\nI mostly cover technical topics, but I also like to talk about the way we work, communicate and use our soft skills.\r\n\r\nOutside work, I like to cook, play pool and have a beer with some friends.",
      "TagLine": "Info Support, IT Consultant",
      "IsTopSpeaker": false,
      "ProfilePictureUrl": "img/winter-2024/speakers/jarne-van-aerde.jpg",
      "sessions": [
        "accelerate-your-frontend-development-with-micro-apps"
      ]
    },
    {
      "Id": "jody-treffers",
      "FullName": "Jody Treffers",
      "Bio": "Jody Treffers is a highly experienced IT professional with over 10 years of expertise in data engineering and cloud engineering. With extensive experience in managing cloud solutions, Jody has been working with public cloud technologies for the past years, helping organizations to adopt and optimize their cloud strategies. In his role as Chapter Lead Data \u0026 AI at Info Support, Jody is responsible for the Managed Data Platform solution, which provides a comprehensive suite of tools and services for managing modern data workloads in the cloud.\r\n\r\nAside from his passion for IT, Jody is also an avid gamer and while he enjoys working with Microsoft technologies he is quick to point out that while he likes Xbox, he firmly believes that Sony Playstation is the superior gaming console.",
      "TagLine": "IT Consultant and Chapter Lead Data \u0026 AI @ Info Support",
      "IsTopSpeaker": false,
      "ProfilePictureUrl": "img/winter-2024/speakers/jody-treffers.jpg",
      "sessions": [
        "microsoft-fabric-onelake-to-rule-them-all"
      ]
    },
    {
      "Id": "maarten-mulders",
      "FullName": "Maarten Mulders",
      "Bio": "Passionate architect, senior developer and trainer; also Java Champion. Passionate about \u0022building the right thing\u0022 and \u0022building the thing right\u0022. Focusing on lean and elegant solutions. Love to share new ideas and knowledge. Outside work, I appreciate creating and consuming good food, photography, and music, in no particular order.",
      "TagLine": "IT Architect @ Info Support // Java Champion",
      "IsTopSpeaker": false,
      "ProfilePictureUrl": "img/winter-2024/speakers/maarten-mulders.jpg",
      "sessions": [
        "five-ways-open-source-will-slow-you-down"
      ]
    },
    {
      "Id": "marco-kuiper",
      "FullName": "Marco Kuiper",
      "Bio": "Marco Kuiper - Chief Projects \u0026 Software Quality. With a software engineering background, he currently sits in the management team of Team Rockstars IT. He is incurably optimistic, loves great design and is very enthusiastic. He inspires and motivates people to share and expand their knowledge.\r\n\r\nGiving presentations excites Marco. He has been talking on multiple occasions and loves sharing his vision and debating the pro\u0027s and con\u0027s. To get away from everything related to work, he loves to travel to explore the world.",
      "TagLine": "Chief Projects \u0026 Software Quality",
      "IsTopSpeaker": false,
      "ProfilePictureUrl": "img/winter-2024/speakers/marco-kuiper.png",
      "sessions": [
        "sustainable-software-may-the-green-code-be-with-you"
      ]
    },
    {
      "Id": "maurice-de-beijer",
      "FullName": "Maurice de Beijer",
      "Bio": "Maurice de Beijer is an independent software consultant and trainer. He specializes in TypeScript, ECMAScript, React and ASP.NET MVC. His work includes popular collaboration software as well as a large, global, safety application for the oil and gas industry. Maurice is also active in the open source community. He teaches ECMAScript, TypeScript, React, Cypress, RxJS and ASP.NET MVC courses. Since 2005, he has received Microsoft’s Yearly Most Valuable Professional Award. Further, Maurice is active in the Dutch dotNed user group and helps organize its meetings.",
      "TagLine": "Tell me, and I will forget. Show me and I may remember. Involve me, and I will understand",
      "IsTopSpeaker": false,
      "ProfilePictureUrl": "img/winter-2024/speakers/maurice-de-beijer.jpg",
      "sessions": [
        "mastering-react-server-components-unlocking-the-future-of-react-development"
      ]
    },
    {
      "Id": "michael-hompus",
      "FullName": "Michaël Hompus",
      "Bio": "Michaël Hompus is a Software Architect at Info Support.\r\nAs architect he is part of several teams, realizing new and innovative solutions, preferable using the Microsoft Cloud.\r\nMichaël has many years of development experience with .NET, Java, Microsoft Azure, Azure DevOps, Office 365 and Dynamics 365.\r\nHis passion is to share knowledge, with colleagues, customers, and peers.\r\nMicrosoft has recognized his efforts for the community by awarding him a Microsoft MVP award.",
      "TagLine": "Software Architect @ Info Support | Microsoft MVP",
      "IsTopSpeaker": false,
      "ProfilePictureUrl": "img/winter-2024/speakers/michael-hompus.jpg",
      "sessions": [
        "a-season-for-speed-turning-puzzles-into-c-performance-wins"
      ]
    },
    {
      "Id": "niels-tanis",
      "FullName": "Niels Tanis",
      "Bio": "Niels Tanis has got a background in .NET development, pentesting and security consultancy. He is Microsoft MVP and has been involved in breaking, defending and building secure applications. He joined Veracode in 2015 and right now he works as a security researcher on a variant of languages and technologies related to Veracode’s Binary Static Analysis service. He is married, father of two and lives in a small village just outside Amersfoort, The Netherlands.",
      "TagLine": "Sr. Principal Security Researcher at Veracode | Microsoft MVP",
      "IsTopSpeaker": false,
      "ProfilePictureUrl": "img/winter-2024/speakers/niels-tanis.png",
      "sessions": [
        "assessing-nuget-packages-more-easily-with-security-scorecards"
      ]
    },
    {
      "Id": "peter-wessels",
      "FullName": "Peter Wessels",
      "Bio": "Peter Wessels is a Java Developer, Speaker, and Teacher at Info Support in the Netherlands. In addition, he leads the Java Community within Info Support. \r\n\r\nHe loves working with talented people to develop software that\u0027s not only effective but also fun to create. In his career, Peter has worn many hats, from lead engineer and project manager to scrum master and product owner. In Dutch, he would be described as a \u0027manusje van alles,\u0027 which roughly translates to a person who seizes every opportunity to learn new technologies and (soft)skills to create impact. This attitude helps him get diverse perspectives on software development. \r\n\r\nAs a speaker, Peter has had the privilege of presenting at prestigious events such as Devoxx UK, J-Fall, and Developer Week.",
      "TagLine": "Passionate Java developer",
      "IsTopSpeaker": false,
      "ProfilePictureUrl": "img/winter-2024/speakers/peter-wessels.jpg",
      "sessions": [
        "battling-your-biased-brain"
      ]
    },
    {
      "Id": "sander-ten-brinke",
      "FullName": "Sander ten Brinke",
      "Bio": "Sander ten Brinke is a Microsoft MVP and Lead Software Engineer at Arcady, a Dutch IT consultancy firm based in Zwolle. He loves working with .NET, Azure, CI/CD and a whole lot more. He always stays up to date with all new technology and loves sharing his knowledge with everyone!",
      "TagLine": "Lead Software Engineer @ Arcady | Microsoft MVP (Developer Technologies)",
      "IsTopSpeaker": false,
      "ProfilePictureUrl": "img/winter-2024/speakers/sander-ten-brinke.jpg",
      "sessions": [
        "everything-a-net-developer-needs-to-know-about-configuration-and-secret-management",
        "from-manual-to-automatic-using-openapi-to-generate-productionready-api-clients"
      ]
    },
    {
      "Id": "sander-van-de-velde",
      "FullName": "Sander van de Velde",
      "Bio": "I’ve been presented with the 2017 – 2024 Microsoft Most Valuable Professional (MVP) award for my Azure IoT community work.\r\n\r\nIn my daily work, I\u0027m an IoT solution architect for Alten - The Netherlands, the consulting and engineering organization for the high-tech sector and specialize in Microsoft Azure IoT. \r\n\r\nI\u0027m involved with many aspects of the Azure IoT Platform and Azure and IoT in general.\r\n\r\nI work on IoT innovations where I add IoT value by working together with clients, partners, and the community.\r\n\r\nFollow me at @svelde",
      "TagLine": "Ask me about Azure IoT, Ask me how to add value",
      "IsTopSpeaker": false,
      "ProfilePictureUrl": "img/winter-2024/speakers/sander-van-de-velde.jpg",
      "sessions": [
        "experience-the-basics-of-azure-iot-dashboarding-and-beyond"
      ]
    },
    {
      "Id": "stephan-van-rooij",
      "FullName": "Stephan van Rooij",
      "Bio": "A blogger, a speaker but mainly a software architect with a strong focus on security, identity and automation. My day job is all .NET core and single-sign-on. If I have some spare time, I\u0027m mostly working on one off my home automation projects (with over half a million combined downloads)\r\n\r\nI\u0027m also an occasional contributor to @azure/msal, azure/microsoft docs and Azure pipeline tasks\r\n\r\nCheck my blog or github profile for more details",
      "TagLine": "Software architect at Smartersoft",
      "IsTopSpeaker": false,
      "ProfilePictureUrl": "img/winter-2024/speakers/stephan-van-rooij.jpg",
      "sessions": [
        "protect-your-api-with-entra-from-zero-security-to-security-hero"
      ]
    },
    {
      "Id": "wilko-van-de-velde",
      "FullName": "Wilko van de Velde",
      "Bio": "Wilko is a data enthusiast, blogger and an experienced technical consultant who has worked on numerous data and IoT projects. He now works as a Data \u0026 Analytics Consultant for Alten Netherlands and is specialised in data- and IoT solutions.",
      "TagLine": "Data \u0026 Analytics Consultant at Alten Nederland",
      "IsTopSpeaker": false,
      "ProfilePictureUrl": "img/winter-2024/speakers/wilko-van-de-velde.jpg",
      "sessions": [
        "experience-the-basics-of-azure-iot-dashboarding-and-beyond"
      ]
    },
    {
      "Id": "willem-meints",
      "FullName": "Willem Meints",
      "Bio": "Willem Meints is an AI/machine learning expert for Info Support and Microsoft AI MVP. He has worked for years on several machine learning algorithms and recently wrote a book about deep learning using CNTK.",
      "TagLine": "Technoloy Advocate/Microsoft AI MVP",
      "IsTopSpeaker": false,
      "ProfilePictureUrl": "img/winter-2024/speakers/willem-meints.jpg",
      "sessions": [
        "building-a-chat-assistent-with-azure-openai-service"
      ]
    }
  ],
  "Sessions": [
    {
      "Id": "96986dfc-b099-4478-b36c-c6bb0bd28ed6",
      "Title": "Registration and Welcome",
      "Description": null,
      "StartsAt": "2024-01-26T08:30:00",
      "EndsAt": "2024-01-26T09:00:00",
      "IsServiceSession": true,
      "speakers": [],
      "SessionFormat": null,
      "Level": null,
      "Room": "Nexus"
    },
    {
      "Id": "add-observability-to-any-microservices-environment-part-1",
      "Title": "Add observability to any microservices environment (part 1)",
      "Description": "Get insights into your applications and infrastructure in real-time with the help of the monitoring, tracing and logging.\r\n\r\nThis workshop will show you all the details about adding and observability platform for ingesting, monitoring, visualizing and analyzing metrics, traces and spans.\r\n\r\nSome of the key concepts we will cover:\r\n- How can we keep track of our running services, how can we alert on failures.\r\n- How can we get an overview on how services interact real time.\r\n- How do we add logging, in such a way we can link the log lines to our traces.\r\n- How can we add performance metrics about our services.",
      "StartsAt": "2024-01-26T09:00:00",
      "EndsAt": "2024-01-26T12:00:00",
      "IsServiceSession": false,
      "speakers": [
        "glenn-versweyveld"
      ],
      "SessionFormat": "Full-day workshop",
      "Level": "Intermediate",
      "Room": "Room 1: Vader"
    },
    {
      "Id": "accelerate-your-frontend-development-with-micro-apps",
      "Title": "Accelerate your frontend development with micro apps",
      "Description": "Are you ready to take your frontend development to the next level? Join us in this exciting workshop, where we\u0027ll guide you on a transformative journey from novice to proficient frontend monorepo developer.\r\n\r\nBy the end of this workshop, you\u0027ll be equipped with the knowledge and tools to harness the full potential of frontend monorepos, enabling you to:\r\n\r\n- Streamline your frontend development process.\r\n- Boost code quality and development speed.\r\n- Effortlessly manage versions and dependencies across multiple packages.\r\n\r\nWhether you\u0027re a seasoned frontend developer looking to enhance your skills or someone just starting on their frontend journey, This workshop will provide valuable insights and practical guidance to take your projects to the next level. Join us and unlock the true potential of frontend monorepos!",
      "StartsAt": "2024-01-26T09:00:00",
      "EndsAt": "2024-01-26T12:00:00",
      "IsServiceSession": false,
      "speakers": [
        "jarne-van-aerde",
        "daniel-mertens"
      ],
      "SessionFormat": "Half-day workshop",
      "Level": "Advanced",
      "Room": "Room 2: Chewbacca"
    },
    {
      "Id": "experience-the-basics-of-azure-iot-dashboarding-and-beyond",
      "Title": "Experience the basics of Azure IoT, dashboarding … and beyond",
      "Description": "Internet of Things (IoT) is hot and happening. Many companies benefit from their machine data by optimizing their processes with remote monitoring and predictive maintenance.\r\n\r\n,,But I don\u0027t know anything about IoT. How should I start? How do I get value from incoming raw telemetry?\u0027\u0027\r\n\r\nThe best way to learn it is to experience it!\r\n\r\nWithin this half-day workshop, you\u0027ll follow the scenario in which a remote coffee machine is connected to Azure for monitoring and management of issues. You can monitor device telemetry such as water temperature and water level, observe the state of your machine, set the optimal temperature, and send commands. Next to that, you learn how to query the data using KQL and use that for building simple but effective dashboards.\r\n\r\nWith this introduction, you will get an idea of the basic IoT principles by hands-on experience with a simulated device, Azure IoT Hub, Azure Data Explorer and Visual Studio Code. So, bring your laptop and prepare yourself for future IoT related cases and telemetry exploration within your organization.\r\n\r\nYou will turn your laptop into a coffeemaker. Check out the prerequisites at https://github.com/sandervandevelde/Experience-the-basics-of-Azure-IoT/",
      "StartsAt": "2024-01-26T09:00:00",
      "EndsAt": "2024-01-26T12:00:00",
      "IsServiceSession": false,
      "speakers": [
        "sander-van-de-velde",
        "wilko-van-de-velde"
      ],
      "SessionFormat": "Half-day workshop",
      "Level": "Introductory and overview",
      "Room": "Room 3: C-3PO"
    },
    {
      "Id": "679f990d-010b-45df-b0e5-2c7c63c097af",
      "Title": "Lunch",
      "Description": null,
      "StartsAt": "2024-01-26T12:00:00",
      "EndsAt": "2024-01-26T13:00:00",
      "IsServiceSession": true,
      "speakers": [],
      "SessionFormat": null,
      "Level": null,
      "Room": "Nexus"
    },
    {
      "Id": "add-observability-to-any-microservices-environment-part-2",
      "Title": "Add observability to any microservices environment (part 2)",
      "Description": "Get insights into your applications and infrastructure in real-time with the help of the monitoring, tracing and logging.\r\n\r\nThis workshop will show you all the details about adding and observability platform for ingesting, monitoring, visualizing and analyzing metrics, traces and spans.\r\n\r\nSome of the key concepts we will cover:\r\n- How can we keep track of our running services, how can we alert on failures.\r\n- How can we get an overview on how services interact real time.\r\n- How do we add logging, in such a way we can link the log lines to our traces.\r\n- How can we add performance metrics about our services.",
      "StartsAt": "2024-01-26T13:00:00",
      "EndsAt": "2024-01-26T16:00:00",
      "IsServiceSession": false,
      "speakers": [
        "glenn-versweyveld"
      ],
      "SessionFormat": "Full-day workshop",
      "Level": "Intermediate",
      "Room": "Room 1: Vader"
    },
    {
      "Id": "mastering-react-server-components-unlocking-the-future-of-react-development",
      "Title": "Mastering React Server Components: Unlocking the Future of React Development",
      "Description": "Get ready to supercharge your web development skills with React Server Components! In this immersive workshop we\u0027ll unlock the full potential of this revolutionary technology and explore how it\u0027s transforming the way developers build lightning-fast, efficient web applications.\r\n\r\nJoin us as we delve into the exciting world of React Server Components, which seamlessly blend server-side rendering with client-side interactivity for unparalleled performance and user experience. You\u0027ll gain hands-on experience through practical exercises, real-world examples, and expert guidance on how to harness the power of Server Components in your own projects.\r\n\r\nThroughout the workshop, we\u0027ll cover essential topics, including:\r\n- Understanding the differences between Server and Client Components\r\n- Implementing Server Components to optimize data fetching and reduce JavaScript bundle size\r\n- Integrating Server and Client Components for a seamless user experience\r\n- Strategies for effectively passing data between components and managing state\r\n- How to do all of this from server to client in a type safe way using TypeScript\r\n- Tips and best practices for maximizing the performance benefits of React Server Components",
      "StartsAt": "2024-01-26T13:00:00",
      "EndsAt": "2024-01-26T16:00:00",
      "IsServiceSession": false,
      "speakers": [
        "maurice-de-beijer"
      ],
      "SessionFormat": "Half-day workshop",
      "Level": "Intermediate",
      "Room": "Room 2: Chewbacca"
    },
    {
      "Id": "microsoft-fabric-onelake-to-rule-them-all",
      "Title": "Microsoft Fabric: OneLake to rule them all",
      "Description": "OneLake to find them, OneLake to integrate them all and in the Fabric bind them.\r\n\r\nIn this workshop we’ll cover how to build an end-to-end analytics solution using Microsoft Fabric. We’ll cover subjects such as:\r\n\r\n•\tHow to move (or not move) data\r\n•\tWorking with Lakehouses\r\n•\tWhen and how to use data warehouses\r\n•\tHow to drive actions based on data\r\n•\tAnd how to handle security, governance, and compliance.\r\n",
      "StartsAt": "2024-01-26T13:00:00",
      "EndsAt": "2024-01-26T16:00:00",
      "IsServiceSession": false,
      "speakers": [
        "jody-treffers",
        "ivo-geurtsen"
      ],
      "SessionFormat": "Half-day workshop",
      "Level": "Intermediate",
      "Room": "Room 3: C-3PO"
    },
    {
      "Id": "e97402c4-1023-42b8-adcb-28d2c16b29ea",
      "Title": "Registration and Welcome",
      "Description": null,
      "StartsAt": "2024-01-27T08:30:00",
      "EndsAt": "2024-01-27T09:00:00",
      "IsServiceSession": true,
      "speakers": [],
      "SessionFormat": null,
      "Level": null,
      "Room": "Nexus"
    },
    {
      "Id": "sustainable-software-may-the-green-code-be-with-you",
      "Title": "Sustainable Software: May the Green Code Be with You",
      "Description": "In a galaxy not so far away, software development is taking on an eco-friendly twist! Join me for a journey into the world of Green Software Development, where we explore how the Force of sustainability can be harnessed to create a better, greener future for software and the planet.\r\n\r\nWe\u0027ll fly away to various topics, including:\r\n- The Green Side of Code: Discover the fundamental principles of Green Software Development and how they can lead to reduced energy consumption, lower carbon footprints, and more environmentally responsible software.\r\n- Eco-Jedi Tools: Explore the tools and techniques at the heart of Green Software Development, including energy-efficient coding practices and sustainable development methodologies.\r\n- Carbon Emissions and the Dark Side: Learn about the environmental impact of software and how we can combat the \u0022Dark Side\u0022 of excessive energy consumption with eco-conscious programming.\r\n- Ewoks vs. Energy Efficiency: Are you building your software like the energy-efficient Ewoks or the resource-hungry Death Star?\r\n- The Path to a Greener Future: We\u0027ll discuss the challenges and opportunities ahead on our journey toward a more sustainable software galaxy and how you can be a part of it.\r\n\r\nJoin me for an engaging and informative presentation where we combine the power of technology and the wisdom of the Jedi to bring balance to the software development Force. Together, we\u0027ll ensure that the code is green, and our planet is preserved for generations to come. May the Green Code Be with You!",
      "StartsAt": "2024-01-27T09:00:00",
      "EndsAt": "2024-01-27T10:00:00",
      "IsServiceSession": false,
      "speakers": [
        "marco-kuiper"
      ],
      "SessionFormat": "Session",
      "Level": "Introductory and overview",
      "Room": "Room 1: Vader"
    },
    {
      "Id": "4343d6d7-ec84-4885-ad27-8e6daf1df1a8",
      "Title": "Coffee Break",
      "Description": null,
      "StartsAt": "2024-01-27T10:00:00",
      "EndsAt": "2024-01-27T10:30:00",
      "IsServiceSession": true,
      "speakers": [],
      "SessionFormat": null,
      "Level": null,
      "Room": "Nexus"
    },
    {
      "Id": "getting-a-grip-on-your-code-dependencies",
      "Title": "Getting a grip on your code dependencies",
      "Description": "I\u0027m sure every developer wants to be able to change code with confidence and without fear. Readable and self-explanatory code is one aspect of that. Too much coupling is another major source of problems that prevent you from changing one part of the system without causing side-effects. In this talk, I\u0027d like you to show you common sources of unnecessary coupling and offer you options to help prevent and/or break those. I\u0027ll talk about how principles like Don\u0027t Repeat Yourself and Dependency Injection can be a double-edge sword, how to detect too unnecessary dependencies and how to use the Dependency Inversion Principle to unravel some of those. And yes, I will also talk about controlling dependencies on the package level.",
      "StartsAt": "2024-01-27T10:30:00",
      "EndsAt": "2024-01-27T11:20:00",
      "IsServiceSession": false,
      "speakers": [
        "dennis-doomen"
      ],
      "SessionFormat": "Session",
      "Level": "Advanced",
      "Room": "Room 1: Vader"
    },
    {
      "Id": "from-manual-to-automatic-using-openapi-to-generate-productionready-api-clients",
      "Title": "From manual to automatic: Using OpenAPI to generate production-ready API clients",
      "Description": "Are you tired of spending hours creating API clients and updating them every time the API changes?\r\n\r\nIn this session, you\u0027ll learn how to streamline your API development process with OpenAPI and code generation tools. We\u0027ll discuss how these tools can automate the process of generating production-ready API clients and how they can save you valuable time and effort. You\u0027ll discover the many benefits of this approach, including improved code reusability, more consistent API development and more.\r\n\r\nBy the end of this talk, you\u0027ll have a better understanding of how to leverage OpenAPI and code generation tools in your projects and take your API development to the next level!",
      "StartsAt": "2024-01-27T10:30:00",
      "EndsAt": "2024-01-27T11:20:00",
      "IsServiceSession": false,
      "speakers": [
        "sander-ten-brinke"
      ],
      "SessionFormat": "Session",
      "Level": "Intermediate",
      "Room": "Room 2: Chewbacca"
    },
    {
      "Id": "tales-from-the-trenches-a-new-data-engineers-story-of-success-and-struggle",
      "Title": "Tales from the Trenches: A New Data Engineer\u0027s Story of Success and Struggle",
      "Description": "Once upon a time, there was a junior data engineer who believed she could conquer any data challenge that came her way. But as she soon discovered, the world of data engineering was full of surprises - not all of them pleasant. Despite the struggles and setbacks she faced, the intrepid junior data engineer refused to give up. With determination and a healthy dose of humor, she persevered, and in the end, emerged victorious. Accompany her on her journey to discover how she turned setbacks into opportunities for growth, whilst also learning a thing or two on what to avoid when building a modern data platform.",
      "StartsAt": "2024-01-27T10:30:00",
      "EndsAt": "2024-01-27T11:20:00",
      "IsServiceSession": false,
      "speakers": [
        "amy-van-bijsterveldt"
      ],
      "SessionFormat": "Session",
      "Level": "Intermediate",
      "Room": "Room 3: C-3PO"
    },
    {
      "Id": "five-ways-open-source-will-slow-you-down",
      "Title": "Five ways open source will slow you down",
      "Description": "Software is changing the world - and even other planets. An ever-growing part of software is “open source”. But it hasn’t always been that way! And “doing something open source” is definitely no guarantee for success. There are numerous ways in which you can use open-source software and be worse off than if you did not.\r\n\r\nJoin me in this talk to find out how not to leverage open-source software in your organisation and your projects. Find out why reading the documentation may not always be your best bet, or how a workaround may eventually work against you. By investigating 5 ways in which you can fail, we can learn valuable lessons on what to do instead.",
      "StartsAt": "2024-01-27T11:30:00",
      "EndsAt": "2024-01-27T12:20:00",
      "IsServiceSession": false,
      "speakers": [
        "maarten-mulders"
      ],
      "SessionFormat": "Session",
      "Level": "Introductory and overview",
      "Room": "Room 1: Vader"
    },
    {
      "Id": "assessing-nuget-packages-more-easily-with-security-scorecards",
      "Title": "Assessing NuGet Packages more easily with Security Scorecards",
      "Description": "Several studies shown that round 80% of our applications consist of other people\u0027s code because why would you re-create something that\u0027s already made by someone else? But with using a NuGet Package that is developed by others, we also put a lot of trust in it, which might result in bigger security problems later. Of course, it\u0027s always a good idea to get updates of libraries in case of a bug fix related to a functional and/or security issue found. But will that be enough? What about packages that have malicious code inside? Even related to your own supply-chain security, any problem in the package its supply-chain implicitly means your supply-chain is compromised as well!\r\nWould it not be nice if there is a better way to review NuGet packages for security? An easier way to perform an assessment based on certain aspects of the package that will tell you more about the package its software security. With the introduction of Scorecards the Open Source Security Foundation (OpenSSF) exactly tries to achieve that. You could consider a Scorecard being the equivalent of a nutrition labels put on food you buy in a supermarket. It will allow you to see what\u0027s inside and determine if you want to eat it or not.\r\nIn this session we start out with different area\u0027s covered by of OpenSSF Scorecards, like how well it\u0027s maintained, does the build have dangerous workflows, and does the project use other security tools to check for problems? We\u0027re also going to identify additional area\u0027s for NuGet packages in which we could add additional information related to reproducibility, insights on what .NET APIs are used, and security review of the codebase. All combined will give us the ability to assess a NuGet package its security posture more easily and improve our own application security.",
      "StartsAt": "2024-01-27T11:30:00",
      "EndsAt": "2024-01-27T12:20:00",
      "IsServiceSession": false,
      "speakers": [
        "niels-tanis"
      ],
      "SessionFormat": "Session",
      "Level": "Intermediate",
      "Room": "Room 2: Chewbacca"
    },
    {
      "Id": "1554a7fe-4cdf-4be4-8e87-769df5ff415e",
      "Title": "Lunch",
      "Description": null,
      "StartsAt": "2024-01-27T12:20:00",
      "EndsAt": "2024-01-27T13:00:00",
      "IsServiceSession": true,
      "speakers": [],
      "SessionFormat": null,
      "Level": null,
      "Room": "Nexus"
    },
    {
      "Id": "everything-a-net-developer-needs-to-know-about-configuration-and-secret-management",
      "Title": "Everything a .NET developer needs to know about configuration and secret management",
      "Description": "App configuration. Settings. Secrets. We have all dealt with these things in our code without thinking much about it.\r\n\r\nBut how does this actually work in .NET and how do you make the most of it? And more importantly, how do you store them correctly and prevent leaking secrets?\r\n\r\nThis talk will teach you how configuration works in .NET, what you should and shouldn\u0027t do, and how you can use the power of the cloud to keep your secrets safe!",
      "StartsAt": "2024-01-27T13:00:00",
      "EndsAt": "2024-01-27T13:50:00",
      "IsServiceSession": false,
      "speakers": [
        "sander-ten-brinke"
      ],
      "SessionFormat": "Session",
      "Level": "Intermediate",
      "Room": "Room 1: Vader"
    },
    {
      "Id": "a-season-for-speed-turning-puzzles-into-c-performance-wins",
      "Title": "A Season for Speed: Turning Puzzles into C# Performance Wins",
      "Description": "Welcome to a world where coding puzzles lead to fast C# skills!\r\n\r\nIn this talk, I\u0027ll take you through an amazing journey, inspired by Advent of Code. We\u0027ll look at how these daily brain teasers helped me make C# code run quicker.\r\n\r\nYou\u0027ll learn simple tricks and methods that make a big difference in speed. This session is perfect for anyone interested in C#, from beginners to those who already code.\r\n\r\nJoin us to see how fun puzzles can transform your C# coding speed!\u0022",
      "StartsAt": "2024-01-27T13:00:00",
      "EndsAt": "2024-01-27T13:50:00",
      "IsServiceSession": false,
      "speakers": [
        "michael-hompus"
      ],
      "SessionFormat": "Session",
      "Level": "Advanced",
      "Room": "Room 2: Chewbacca"
    },
    {
      "Id": "supercharge-your-data-analysis-with-azure-databricks-and-microsoft-fabric-integration",
      "Title": "Supercharge Your Data Analysis with Azure Databricks and Microsoft Fabric Integration",
      "Description": "This session is all about the bringing the power of Azure Databricks and Microsoft Fabric together. Here\u0027s what we\u0027ll focus on:\r\n• Access Azure Databricks Delta Tables in Fabric: How to easily access Azure Databricks Delta Tables in Fabric, so you can quickly create shortcuts to read the data and analyse in Power BI via DirectLake.\r\n• Access Fabric Delta table in Azure Databricks: The seamless process for accessing Fabric Delta tables in Azure Databricks, including ingesting data into OneLake using the pipeline experience and creating a delta table that can be easily read and modified via Azure Databricks.",
      "StartsAt": "2024-01-27T13:00:00",
      "EndsAt": "2024-01-27T13:50:00",
      "IsServiceSession": false,
      "speakers": [
        "anu-singh"
      ],
      "SessionFormat": "Session",
      "Level": "Introductory and overview",
      "Room": "Room 3: C-3PO"
    },
    {
      "Id": "building-a-chat-assistent-with-azure-openai-service",
      "Title": "Building a chat assistent with Azure OpenAI service",
      "Description": "You’ve probably used ChatGPT or Github copilot in your work at least once or maybe you’re using it on a daily basis and maybe you’re wondering how you can build something like that yourself. This is the session for you. I’ll show you how we made our own ChatGPT instance at Info Support and connected it to our internal knowledge base. We’ll cover how to write a good system prompt, how to structure the conversation, and how to connect your own data sources. Finally, we’ll talk a little bit about using the chat API for other things than chat. ",
      "StartsAt": "2024-01-27T14:00:00",
      "EndsAt": "2024-01-27T14:50:00",
      "IsServiceSession": false,
      "speakers": [
        "willem-meints"
      ],
      "SessionFormat": "Session",
      "Level": "Intermediate",
      "Room": "Room 1: Vader"
    },
    {
      "Id": "github-codespaces-for-everyone-everywhere",
      "Title": "GitHub CodeSpaces for everyone, everywhere!",
      "Description": "With GitHub Codespaces, you can have a consistent development experience right in your browser! Write your code from every device without worrying about installing anything. Codespaces are avaliable for everyone with a GitHub account for free. A great opportunity to get a better development experience, whether you are Dev or Ops.\r\n\r\nIn this session, I\u0027ll show you how Codespaces work and how you create one from your GitHub repository. We will walk through use cases, configurations and the options to work with Visual studio code, so you can make the most of of your codespaces. After this session you will be able to get started straight away!",
      "StartsAt": "2024-01-27T14:00:00",
      "EndsAt": "2024-01-27T14:50:00",
      "IsServiceSession": false,
      "speakers": [
        "barbara-forbes"
      ],
      "SessionFormat": "Session",
      "Level": "Intermediate",
      "Room": "Room 2: Chewbacca"
    },
    {
      "Id": "protect-your-api-with-entra-from-zero-security-to-security-hero",
      "Title": "Protect your API with Entra - from zero security to security hero",
      "Description": "Security should be top priority in any application these days. In this interactive demonstration I\u0027ll show you how to go from an API without security to an API that is secured with Entra ID.\r\n\r\nJoin this session so you never have to worry about the security of your API ever again.\r\n\r\n- Protecting the API\r\n- What are JWTs (Json Web Tokens)?\r\n- Scopes vs Roles?\r\n- Getting a token as application\r\n- Getting a token as user\r\n\r\nThese principals are not Entra specific and can be applied to other Identity Providers as well, the exact implementation might be slightly different.",
      "StartsAt": "2024-01-27T14:00:00",
      "EndsAt": "2024-01-27T14:50:00",
      "IsServiceSession": false,
      "speakers": [
        "stephan-van-rooij"
      ],
      "SessionFormat": "Session",
      "Level": "Advanced",
      "Room": "Room 3: C-3PO"
    },
    {
      "Id": "df68dbc8-d5c7-4ffc-8eae-1299ac496118",
      "Title": "Break",
      "Description": null,
      "StartsAt": "2024-01-27T14:50:00",
      "EndsAt": "2024-01-27T15:10:00",
      "IsServiceSession": true,
      "speakers": [],
      "SessionFormat": null,
      "Level": null,
      "Room": "Nexus"
    },
    {
      "Id": "battling-your-biased-brain",
      "Title": "Battling your Biased Brain",
      "Description": "Ever heard of the IKEA effect or the bandwagon-effect? In our efforts to delivering great software, there are numerous occasions where our brain tries to trick us. Don’t fall for them!\r\n\r\nIn this talk we will dive into some well-known and researched cognitive biases that impact our judgments in our day-to-day jobs as software creators.\r\nWhen do they typically occur? And why are we falling into these traps from time to time?\r\n\r\nAfter this talk you\u0027ll have a better understanding of how your brain tricks you, how to make better decisions and in the end how to deliver some great software.\r\n\r\nA word of warning; during this talk you may get tricked!",
      "StartsAt": "2024-01-27T15:10:00",
      "EndsAt": "2024-01-27T16:00:00",
      "IsServiceSession": false,
      "speakers": [
        "peter-wessels"
      ],
      "SessionFormat": "Session",
      "Level": "Introductory and overview",
      "Room": "Room 1: Vader"
    }
  ]
}